<template>
  <div>
  <div class="about">
    <h1>This is All About Border Collie</h1>
    <div> <img src="https://encrypted-tbn0.gstatic.com/images?q=tbn%3AANd9GcRFASWyvB7qHfL_r9dmRhWdo_6EvZazwZkmqQ&usqp=CAU">  </div>
  </div>
    <h6> 有關邊境牧羊犬 </h6>
    <div >
        <transition name="slide">
       <div>
      <strong>邊境牧羊犬的特色<svg height="20px" viewBox="0 -32 512.00011 512" width="20px" xmlns="http://www.w3.org/2000/svg"><path d="m342.382812 239.351562c-23.039062-35.941406-62.277343-57.402343-104.964843-57.402343s-81.925781 21.460937-104.960938 57.402343l-55.515625 86.605469c-9.210937 14.367188-13.460937 30.96875-12.292968 47.996094 1.167968 17.03125 7.648437 32.890625 18.738281 45.875 11.097656 12.972656 25.761719 21.839844 42.40625 25.644531 16.644531 3.804688 33.707031 2.179688 49.339843-4.691406l1.046876-.464844c39.335937-16.945312 84.285156-16.789062 123.519531.464844 10.121093 4.449219 20.84375 6.699219 31.664062 6.699219 5.882813 0 11.800781-.667969 17.664063-2.003907 16.644531-3.800781 31.308594-12.667968 42.410156-25.644531 11.09375-12.972656 17.578125-28.835937 18.75-45.871093 1.171875-17.035157-3.078125-33.632813-12.289062-48.007813zm0 0"/><path d="m91.894531 239.238281c16.515625-6.34375 29.0625-19.652343 35.328125-37.476562 5.964844-16.960938 5.476563-36.109375-1.378906-53.921875-6.859375-17.800782-19.335938-32.332032-35.132812-40.921875-16.59375-9.019531-34.824219-10.488281-51.3125-4.132813-33.171876 12.753906-48.394532 53.746094-33.929688 91.398438 11.554688 29.96875 38.503906 48.886718 65.75 48.886718 6.957031 0 13.933594-1.234374 20.675781-3.832031zm0 0"/><path d="m199.613281 171.386719c41.46875 0 75.207031-38.4375 75.207031-85.683594 0-47.257813-33.738281-85.703125-75.207031-85.703125-41.464843 0-75.199219 38.445312-75.199219 85.703125 0 47.246094 33.734376 85.683594 75.199219 85.683594zm0 0"/><path d="m329.496094 192.4375h.003906c6.378906 2.117188 12.886719 3.128906 19.367188 3.128906 30.242187 0 59.714843-22.011718 70.960937-55.839844 6.476563-19.472656 6.050781-40.0625-1.199219-57.972656-7.585937-18.75-21.644531-32.359375-39.589844-38.324218-17.949218-5.964844-37.359374-3.476563-54.660156 7-16.527344 10.007812-29.191406 26.246093-35.660156 45.71875-13.652344 41.078124 4.640625 84.273437 40.777344 96.289062zm0 0"/><path d="m487.875 182.4375-.011719-.011719c-28.597656-21.125-71.367187-11.96875-95.347656 20.421875-23.957031 32.40625-20.210937 75.972656 8.34375 97.113282 10.414063 7.714843 22.71875 11.402343 35.3125 11.402343 21.949219 0 44.785156-11.203125 60.050781-31.804687 23.953125-32.40625 20.210938-75.972656-8.347656-97.121094zm0 0"/></svg> </strong>
       </div>
        </transition>
      <br>
     <div>主要協助農場放牧，故稱「牧羊犬」。邊境牧羊犬以精力旺盛且容易學習雜技運動而聞名，且被學界認為是最聰明的犬種。</div>
      <br>
      <br>
      <div class="description">
       <div class="text"> <strong >邊牧的物種分布</strong>
       <p class="item">原產於蘇格蘭邊境，具強烈的牧羊本能，被當成牧羊犬已有多年的歷史。現主要分布在四個國家：英國、美國、澳大利亞和紐西蘭。屬於工作狂型的犬種，不適合都市生活。全世界的牧羊工作，幾乎一半以上都由它們來擔任。有此一說：如果沒有牛羊給它看管，它就會看牧小孩。而且它天生就會牧羊。</p>
       </div>
       <div class="text"> <strong >邊牧的發展起源</strong>
       <p class="item">最早時期蘇格蘭被放牧的羊以及用來看管羊的犬都是在蘇格蘭群島上被發現的，那些犬都是來源於以前從愛爾蘭移居到蘇格蘭的教士，它們帶過去的犬，在這種崎嶇的地理環境內人們也就只有依靠犬來幫忙集合、驅趕以及看牧牲畜了。根據現代牧羊犬的起源，它們有著「眼神控制」這樣的能力，這種能力是通過在英格蘭和蘇格蘭的邊界地方的牧羊人發展並且訓練出來的，所以人們把這種犬就稱作「邊境牧羊犬」。</p>
       </div>
      <div class="text"> <strong >邊牧的生活習性</strong>
       <p class="item">邊境牧羊犬是好動的工作犬，最適合養在鄉村。如果關著不給活動，此犬種很快就會變得憂鬱，開始搞破壞。此犬種智商高、學習力強、對讚美的迴響良好。牠們具備牧羊的天性，所以懷有保護家庭和地域的警戒心，也是優秀的看門犬，會照顧家裡的小孩。雖然牠們和孩童以及其他從小一起養大的寵物相處融洽，有時對陌生人很兇，像牧羊時那樣窮追不捨、緊咬不放。</p>
       </div>
        <div class="text"> <strong >邊牧的優點</strong>
       <p class="item">邊境牧羊犬有犬類熊貓之稱，是因為它黑白花色的分布和熊貓相似，尤其是60天以下的幼犬，圓滾滾的體型、蹣跚的步態，更像是一隻小熊貓。當然邊牧也有其他顏色和白色的搭配，諸如紅白、藍白 、黃白、隕石色等等，但通常黑白的搭配被認為是最基礎和最標準的。</p>
        </div>
        <div class="text">
        </div>
        <div class="text"> <strong >邊牧的缺點</strong>
       <p class="item">邊牧在自己的地盤上能夠憑藉聰明才智作威作福，但幾乎50%以上的邊牧甚至有被驚嚇後小便失禁的經歷。即使體形較大的成年邊牧，在陌生的地方面對陌生人的撫摩，也會抿著耳朵甚至翻著肚皮表現出完全地臣服。</p>
        </div>
        </div>
    </div>
  </div>
</template>

<script>
export default {
  data () {
    return {
      age: 5
    }
  }
}
</script>

<style scoped>
 .description {
   display: flex;
   flex-wrap: wrap;
   width: 100%;
 }
  .about {
    background-color:#333;
  }
  h1 {
    color: #fff
  }
  .text {
    width: 31%;
    margin: 10px 15px;
  }
  @media (max-width: 1282px ) {
    .description div {
      width: 50%
    }
  }
  @media (max-width: 568px ) {
    .description div {
      width: 100%
    }
  }
.slide-enter-active {
   animation: slide-in 200ms ease-out forwards;
  }

  .slide-leave-active {
   animation: slide-out 200ms ease-out forwards;

  }

@keyframes slide-in {
  from {
   transform: translateY(-30px);
   opacity: 0;
  }
  to {
     transform: translateY(0);
     opacity: 1;
  }
}

@keyframes slide-out {
    from {
     transform: translateY(0);
     opacity: 1;
    }
    to {
     transform: translateY(-30px);
     opacity: 0;
    }
}
</style>
